# Exercises: Working with Databases in Python

For the exercises, we will be practicing the steps outlined in this [article](https://towardsdatascience.com/do-you-know-python-has-a-built-in-database-d553989c87bd). You can skip the portion where the author downloads a separate SQL client to examine the database.

## Import Libraries

We will need `pandas` and `sqlite3`. SQLite is a small, self-contained database engine that comes with Python so you will not have to do any additional installations for this lesson. If you want to connect to a different database engine, such as SQL server, you may need additional libraries such as `sqlalchemy` or `pyodbc` and a tool called a driver which helps to connect a database to an application.

In [6]:
# Import sqlite3 and pandas.
import sqlite3 as sl
import pandas as pd

## Create a Database

In the article, the author shows how to use `sqlite3` to open a connection to an existing database or create a new one. Use this method to make a new database called `exercises.db`.

In [7]:
# Create a new database called exercises.db.
conn = sl.connect('exercises.db')

## Create a Table

Follow the steps in the article to create a table called `favorite_books.db`. This table should include columns for the title, author, and a short description of why it is a favorite.

In [9]:
# Create a new table in your database.
with conn:
    conn.execute("""
        CREATE TABLE favorite_books (
            id INTEGER NOT NULL PRIMARY KEY AUTOINCREMENT,
            title TEXT,
            author TEXT,
            description TEXT
        );
    """)

## Insert Records

Add 3 entries to your table for your top 3 favorite books.

In [14]:
# Add your 3 favorite books to your table.
sl = 'INSERT INTO favorite_books (id, title, author, description) values(?, ?, ?, ?)'
data = [
    (1, 'The Bloody Chamber', 'Angela Carter', 'Feminist re-tellings of fairy tales'),
    (2, 'Vurt', 'Jeff Noon', 'Psychadelic pseudo-cyberpunk'),
    (3, 'Don Quixote', 'Miguel de Cervantes', 'The Spanish Classic of Chivalry')
]

In [15]:
with conn:
    conn.executemany(sl, data)

## Query Your Table

Write a `SELECT` query to output the 3 records in your table.

In [16]:
# Write your SELECT query here.
pd.read_sql_query('select * from favorite_books', conn)

,id,title,author,description
0,1,The Bloody Chamber,Angela Carter,Feminist re-tellings of fairy tales
1,2,Vurt,Jeff Noon,Psychadelic pseudo-cyberpunk
2,3,Don Quixote,Miguel de Cervantes,The Spanish Classic of Chivalry

## Create a New Table with Pandas

Create a new table called `favorite_movies` with your top 3 favorite movies. Each movie should have an id and a title. This time, use Pandas to first make a dataframe and then write the dataframe to SQL. Write a `SELECT` query to confirm that the new table does have your top 3 favorite movies.

In [19]:
# Use Pandas to make a new table in your database.
d = {'title' : ['Uncut Gems', 'Uncle Boonmee Who Can Recall His Past Lives', 'Portrait of a Lady on Fire'],
    'director' : ['Josh and Benny Safdie', 'Apichatpong Weerasethakul', 'Celine Sciamma'],
    'year' : [2019, 2010, 2019]
    }
df = pd.DataFrame(data=d)
df.head()

,title,director,year
0,Uncut Gems,Josh and Benny Safdie,2019
1,Uncle Boonmee Who Can Recall His Past Lives,Apichatpong Weerasethakul,2010
2,Portrait of a Lady on Fire,Celine Sciamma,2019

In [20]:
df.to_sql('favorite_movies', conn)

3

In [21]:
pd.read_sql_query('select * from favorite_movies', conn)

,index,title,director,year
0,0,Uncut Gems,Josh and Benny Safdie,2019
1,1,Uncle Boonmee Who Can Recall His Past Lives,Apichatpong Weerasethakul,2010
2,2,Portrait of a Lady on Fire,Celine Sciamma,2019